tiborsimon/embedded-tdd-headers/pic/pic18/pic18f67j94_tdd.h
#define RPINR4_5                      522
#define U3RXR0                        523
#define U3RXR                         524
#define U3RXR1                        525
#define U3RXR2                        526
#define U3RXR3                        527
#define U3TXR0                        528
#define U3TXR                         529
#define U3TXR1                        530
#define U3TXR2                        531
#define U3TXR3                        532
#define RPINR6_7                      533
#define U4RXR0                        534
#define U4RXR                         535
#define U4RXR1                        536
#define U4RXR2                        537
#define U4RXR3                        538
#define U4TXR                         539
#define U4TXR0                        540
#define U4TXR1                        541
#define U4TXR2                        542
#define U4TXR3                        543
#define RPINR8_9                      544
#define SCK1R0                        545
#define SCK1R                         546
#define SCK1R1                        547
#define SCK1R2                        548
#define SCK1R3                        549
#define SDI1R                         550
#define SDI1R0                        551
#define SDI1R1                        552
#define SDI1R2                        553
#define SDI1R3                        554
#define RPINR10_11                    555
#define SS1R0                         556
#define SS1R                          557
#define SS1R1                         558
#define SS1R2                         559
#define SS1R3                         560
#define SCK2R                         561
#define SCK2R0                        562
#define SCK2R1                        563
#define SCK2R2                        564
#define SCK2R3                        565
#define RPINR12_13                    566
#define SDI2R0                        567
#define SDI2R                         568
#define SDI2R1                        569
#define SDI2R2                        570
#define SDI2R3                        571
#define SS2R                          572
#define SS2R0                         573
#define SS2R1                         574
#define SS2R2                         575
#define SS2R3                         576
#define RPINR14_15                    577
#define FLT0R0                        578
#define FLT0R                         579
#define FLT0R1                        580
#define FLT0R2                        581
#define FLT0R3                        582
#define ECCP1R                        583
#define ECCP1R0                       584
#define ECCP1R1                       585
#define ECCP1R2                       586
#define ECCP1R3                       587
#define RPINR16_17                    588
#define ECCP2R                        589
#define ECCP2R0                       590
#define ECCP2R1                       591
#define ECCP2R2                       592
#define ECCP2R3                       593
#define ECCP3R                        594
#define ECCP3R0                       595
#define ECCP3R1                       596
#define ECCP3R2                       597
#define ECCP3R3                       598
#define RPINR18_19                    599
#define IOC0R0                        600
#define IOC0R                         601
#define IOC0R1                        602
#define IOC0R2                        603
#define IOC0R3                        604
#define IOC1R                         605
#define IOC1R0                        606
#define IOC1R1                        607
#define IOC1R2                        608
#define IOC1R3                        609
#define RPINR20_21                    610
#define IOC2R0                        611
#define IOC2R                         612
#define IOC2R1                        613
#define IOC2R2                        614
#define IOC2R3                        615
#define IOC3R                         616
#define IOC3R0                        617
#define IOC3R1                        618
#define IOC3R2                        619
#define IOC3R3                        620
#define RPINR22_23                    621
#define IOC4R                         622
#define IOC4R0                        623
#define IOC4R1                        624
#define IOC4R2                        625
#define IOC4R3                        626
#define IOC5R0                        627
#define IOC5R                         628
#define IOC5R1                        629
#define IOC5R2                        630
#define IOC5R3                        631
#define RPINR24_25                    632
#define IOC6R0                        633
#define IOC6R                         634
#define IOC6R1                        635
#define IOC6R2                        636
#define IOC6R3                        637
#define IOC7R                         638
#define IOC7R0                        639
#define IOC7R1                        640
#define IOC7R2                        641
#define IOC7R3                        642
#define RPINR26_27                    643
#define INT1R                         644
#define INT1R0                        645
#define INT1R1                        646
#define INT1R2                        647
#define INT1R3                        648
#define INT2R                         649
#define INT2R0                        650
#define INT2R1                        651
#define INT2R2                        652
#define INT2R3                        653
#define RPINR28_29                    654
#define INT3R                         655
#define INT3R0                        656
#define INT3R1                        657
#define INT3R2                        658
#define INT3R3                        659
#define MDMINR0                       660
#define MDMINR                        661
#define MDMINR1                       662
#define MDMINR2                       663
#define MDMINR3                       664
#define RPINR30_31                    665
#define MDCIN1R                       666
#define MDCIN1R0                      667
#define MDCIN1R1                      668
#define MDCIN1R2                      669
#define MDCIN1R3                      670
#define MDCIN2R                       671
#define MDCIN2R0                      672
#define MDCIN2R1                      673
#define MDCIN2R2                      674
#define MDCIN2R3                      675
#define RPINR32_33                    676
#define CCP4R0                        677
#define CCP4R                         678
#define CCP4R1                        679
#define CCP4R2                        680
#define CCP4R3                        681
#define CCP5R0                        682
#define CCP5R                         683
#define CCP5R1                        684
#define CCP5R2                        685
#define CCP5R3                        686
#define RPINR34_35                    687
#define CCP6R                         688
#define CCP6R0                        689
#define CCP6R1                        690
#define CCP6R2                        691
#define CCP6R3                        692
#define CCP7R                         693
#define CCP7R0                        694
#define CCP7R1                        695
#define CCP7R2                        696
#define CCP7R3                        697
#define RPINR36_37                    698
#define CCP8R                         699
#define CCP8R0                        700
#define CCP8R1                        701
#define CCP8R2                        702
#define CCP8R3                        703
#define CCP9R                         704
#define CCP9R0                        705
#define CCP9R1                        706
#define CCP9R2                        707
#define CCP9R3                        708
#define RPINR38_39                    709
#define CCP10R0                       710
#define CCP10R                        711
#define CCP10R1                       712
#define CCP10R2                       713
#define CCP10R3                       714
#define T0CKIR                        715
#define T0CKIR0                       716
#define T0CKIR1                       717
#define T0CKIR2                       718
#define T0CKIR3                       719
#define RPINR40_41                    720
#define T1GR0                         721
#define T1GR                          722
#define T1GR1                         723
#define T1GR2                         724
#define T1GR3                         725
#define T1CKIR                        726
#define T1CKIR0                       727
#define T1CKIR1                       728
#define T1CKIR2                       729
#define T1CKIR3                       730
#define RPINR42_43                    731
#define T3GR                          732
#define T3GR0                         733
#define T3GR1                         734
#define T3GR2                         735
#define T3GR3                         736
#define T3CKIR                        737
#define T3CKIR0                       738
#define T3CKIR1                       739
#define T3CKIR2                       740
#define T3CKIR3                       741
#define RPINR44_45                    742
#define T5GR                          743
#define T5GR0                         744
#define T5GR1                         745
#define T5GR2                         746
#define T5GR3                         747
#define T5CKIR0                       748
#define T5CKIR                        749
#define T5CKIR1                       750
#define T5CKIR2                       751
#define T5CKIR3                       752
#define RPINR46_47                    753
#define PBIO0R                        754
#define PBIO0R0                       755
#define PBIO0R1                       756
#define PBIO0R2                       757
#define PBIO0R3                       758
#define PBIO1R                        759
#define PBIO1R0                       760
#define PBIO1R1                       761
#define PBIO1R2                       762
#define PBIO1R3                       763
#define RPINR48_49                    764
#define PBIO2R0                       765
#define PBIO2R                        766
#define PBIO2R1                       767
#define PBIO2R2                       768
#define PBIO2R3                       769
#define PBIO3R0                       770
#define PBIO3R                        771
#define PBIO3R1                       772
#define PBIO3R2                       773
#define PBIO3R3                       774
#define RPINR50_51                    775
#define PBIO4R0                       776
#define PBIO4R                        777
#define PBIO4R1                       778
#define PBIO4R2                       779
#define PBIO4R3                       780
#define PBIO5R0                       781
#define PBIO5R                        782
#define PBIO5R1                       783
#define PBIO5R2                       784
#define PBIO5R3                       785
#define RPINR52_53                    786
#define PBIO6R0                       787
#define PBIO6R                        788
#define PBIO6R1                       789
#define PBIO6R2                       790
#define PBIO6R3                       791
#define PBIO7R0                       792
#define PBIO7R                        793
#define PBIO7R1                       794
#define PBIO7R2                       795
#define PBIO7R3                       796
#define ANCON3                        797
#define ANSEL16                       798
#define ANSEL17                       799
#define ANSEL18                       800
#define ANSEL19                       801
#define ANSEL20                       802
#define ANSEL21                       803
#define ANSEL22                       804
#define ANSEL23                       805
#define ANCON2                        806
#define ANSEL8                        807
#define PCFG16                        808
#define ANSEL9                        809
#define PCFG17                        810
#define PCFG18                        811
#define ANSEL10                       812
#define PCFG19                        813
#define ANSEL11                       814
#define PCFG20                        815
#define ANSEL12                       816
#define PCFG21                        817
#define ANSEL13                       818
#define PCFG22                        819
#define ANSEL14                       820
#define PCFG23                        821
#define ANSEL15                       822
#define ANCON1                        823
#define ANSEL0                        824
#define PCFG8                         825
#define ANSEL1                        826
#define PCFG9                         827
#define ANSEL2                        828
#define PCFG10                        829
#define ANSEL3                        830
#define PCFG11                        831
#define ANSEL4                        832
#define PCFG12                        833
#define ANSEL5                        834
#define PCFG13                        835
#define ANSEL6                        836
#define PCFG14                        837
#define ANSEL7                        838
#define PCFG15                        839
#define ADCBUF1L                      840
#define ADCBUF1H                      841
#define ADCBUF2L                      842
#define ADCBUF2H                      843
#define ADCBUF3L                      844
#define ADCBUF3H                      845
#define ADCBUF4L                      846
#define ADCBUF4H                      847
#define ADCBUF5L                      848
#define ADCBUF5H                      849
#define ADCBUF6L                      850
#define ADCBUF6H                      851
#define ADCBUF7L                      852
#define ADCBUF7H                      853
#define ADCBUF8L                      854
#define ADCBUF8H                      855
#define ADCBUF9L                      856
#define ADCBUF9H                      857
#define ADCBUF10L                     858
#define ADCBUF10H                     859
#define ADCBUF11L                     860
#define ADCBUF11H                     861
#define ADCBUF12L                     862
#define ADCBUF12H                     863
#define ADCBUF13L                     864
#define ADCBUF13H                     865
#define ADCBUF14L                     866
#define ADCBUF14H                     867
#define ADCBUF15L                     868
#define ADCBUF15H                     869
#define ADCBUF16L                     870
#define ADCBUF16H                     871
#define ADCBUF17L                     872
#define ADCBUF17H                     873
#define ADCBUF18L                     874
#define ADCBUF18H                     875
#define ADCBUF19L                     876
#define ADCBUF19H                     877
#define ADCBUF20L                     878
#define ADCBUF20H                     879
#define ADCBUF21L                     880
#define ADCBUF21H                     881
#define ADCBUF22L                     882
#define ADCBUF22H                     883
#define ADCBUF23L                     884
#define ADCBUF23H                     885
#define ADCBUF24L                     886
#define ADCBUF24H                     887
#define ADCBUF25L                     888
#define ADCBUF25H                     889
#define ADCTMUEN0L                    890
#define CTMUEN0                       891
#define ADCTMUEN0L_CTMUEN             892
#define CTMUEN1                       893
#define CTMUEN2                       894
#define CTMUEN3                       895
#define CTMUEN4                       896
#define CTMUEN5                       897
#define CTMUEN6                       898
#define CTMUEN7                       899
#define ADCTMUEN0H                    900
#define CTMUEN8                       901
#define ADCTMUEN0H_CTMUEN             902
#define CTMUEN9                       903
#define CTMUEN10                      904
#define CTMUEN11                      905
#define CTMUEN12                      906
#define CTMUEN13                      907
#define CTMUEN14                      908
#define CTMUEN15                      909
#define ADCTMUEN1L                    910
#define ADCTMUEN1L_CTMUEN             911
#define CTUMEN16                      912
#define CTUMEN17                      913
#define CTUMEN18                      914
#define CTUMEN19                      915
#define CTMUEN20                      916
#define CTMUEN21                      917
#define CTMUEN22                      918
#define CTMUEN23                      919
#define ADCTMUEN1H                    920
#define CTUMEN24                      921
#define ADCTMUEN1H_CTMUEN             922
#define CTUMEN25                      923
#define CTUMEN26                      924
#define CTUMEN27                      925
#define CTUMEN28                      926
#define CTUMEN29                      927
#define CTMUEN30                      928
#define ADCHIT0L                      929
#define ADCHIT0L_CHH                  930
#define CHH0                          931
#define CHH1                          932
#define CHH2                          933
#define CHH3                          934
#define CHH4                          935
#define CHH5                          936
#define CHH6                          937
#define CHH7                          938
#define ADCHIT0H                      939
#define ADCHIT0H_CHH                  940
#define CHH8                          941
#define CHH9                          942
#define CHH10                         943
#define CHH11                         944
#define CHH12                         945
#define CHH13                         946
#define CHH14                         947
#define CHH15                         948
#define ADCHIT1L                      949
#define CHH16                         950
#define ADCHIT1L_CHH                  951
#define CHH17                         952
#define CHH18                         953
#define CHH19                         954
#define CHH20                         955
#define CHH21                         956
#define CHH22                         957
#define CHH23                         958
#define ADCHIT1H                      959
#define ADCHIT1H_CHH                  960
#define CHH24                         961
#define CHH25                         962
#define CHH26                         963
#define CHH27                         964
#define CHH28                         965
#define CHH29                         966
#define CHH30                         967
#define ADCSS0L                       968
#define CSS0                          969
#define ADCSS0L_CSS                   970
#define CSS1                          971
#define CSS2                          972
#define CSS3                          973
#define CSS4                          974
#define CSS5                          975
#define CSS6                          976
#define CSS7                          977
#define ADCSS0H                       978
#define CSS8                          979
#define ADCSS0H_CSS                   980
#define CSS9                          981
#define CSS10                         982
#define CSS11                         983
#define CSS12                         984
#define CSS13                         985
#define CSS14                         986
#define CSS15                         987
#define ADCSS1L                       988
#define CSS16                         989
#define ADCSS1L_CSS                   990
#define CSS17                         991
#define CSS18                         992
#define CSS19                         993
#define CSS20                         994
#define CSS21                         995
#define CSS22                         996
#define CSS23                         997
#define ADCSS1H                       998
#define ADCSS1H_CSS                   999
#define CSS24                         1000
#define CSS25                         1001
#define CSS26                         1002
#define CSS27                         1003
#define CSS28                         1004
#define CSS29                         1005
#define CSS30                         1006
#define ADCHS0L                       1007
#define CH0SA0                        1008
#define CH0SA                         1009
#define CH0SA1                        1010
#define CH0SA2                        1011
#define CH0SA3                        1012
#define CH0SA4                        1013
#define CH0NA                         1014
#define CH0NA0                        1015
#define CH0NA1                        1016
#define CH0NA2                        1017
#define ADCHS0H                       1018
#define CH0SB0                        1019
#define CH0SB                         1020
#define CH0SB1                        1021
#define CH0SB2                        1022
#define CH0SB3                        1023
#define CH0SB4                        1024
#define CH0NB                         1025
#define CH0NB0                        1026
#define CH0NB1                        1027
#define CH0NB2                        1028
#define ADCON5L                       1029
#define ADCON5L_CM                    1030
#define CM0                           1031
#define CM1                           1032
#define ADCON5L_WM0                   1033
#define WM                            1034
#define ADCON5L_WM1                   1035
#define ADCON5H                       1036
#define ASINTMD                       1037
#define ASINTMD0                      1038
#define ASINTMD1                      1039
#define CTMUREQ                       1040
#define LPENA                         1041
#define ASENA                         1042
#define ADCON3L                       1043
#define ADCS0                         1044
#define ADCS                          1045
#define ADCS1                         1046
#define ADCS2                         1047
#define ADCS3                         1048
#define ADCS4                         1049
#define ADCS5                         1050
#define ADCS6                         1051
#define ADCS7                         1052
#define ADCON3H                       1053
#define SAMC0                         1054
#define SAMC                          1055
#define SAMC1                         1056
#define SAMC2                         1057
#define SAMC3                         1058
#define SAMC4                         1059
#define PUMPEN                        1060
#define EXTSAM                        1061
#define ADRC                          1062
#define ADCON2L                       1063
#define ALTS                          1064
#define BUFM                          1065
#define SMPI                          1066
#define SMPI0                         1067
#define SMPI1                         1068
#define SMPI2                         1069
#define SMPI3                         1070
#define SMPI4                         1071
#define BUFS                          1072
#define ADCON2H                       1073
#define CSCNA                         1074
#define BUFREGEN                      1075
#define OFFCAL                        1076
#define NVCFG0                        1077
#define PVCFG                         1078
#define PVCFG0                        1079
#define PVCFG1                        1080
#define LCDDATA0                      1081
#define S00C0                         1082
#define S01C0                         1083
#define S02C0                         1084
#define S03C0                         1085
#define S04C0                         1086
#define S05C0                         1087
#define S06C0                         1088
#define S07C0                         1089
#define LCDDATA1                      1090
