tiborsimon/embedded-tdd-headers/pic/pic18/pic18f67j94_tdd.h
#define SSP2CON2_ADMSK5               2207
#define SSP2CON2_ACKSTAT              2208
#define ACKSTAT2                      2209
#define GCEN2                         2210
#define SSP2CON2_GCEN                 2211
#define SSP2CON1                      2212
#define SSP2CON1_SSPM                 2213
#define SSP2CON1_SSPM0                2214
#define SSPM02                        2215
#define SSPM12                        2216
#define SSP2CON1_SSPM1                2217
#define SSP2CON1_SSPM2                2218
#define SSPM22                        2219
#define SSPM32                        2220
#define SSP2CON1_SSPM3                2221
#define SSP2CON1_CKP                  2222
#define CKP2                          2223
#define SSPEN2                        2224
#define SSP2CON1_SSPEN                2225
#define SSPOV2                        2226
#define SSP2CON1_SSPOV                2227
#define WCOL2                         2228
#define SSP2CON1_WCOL                 2229
#define SSP2STAT                      2230
#define SSP2STAT_BF                   2231
#define BF2                           2232
#define SSP2STAT_UA                   2233
#define UA2                           2234
#define SSP2STAT_R_W                  2235
#define RW2                           2236
#define SSP2STAT_nWRITE               2237
#define SSP2STAT_nW                   2238
#define READ_WRITE2                   2239
#define nW2                           2240
#define SSP2STAT_I2C_READ             2241
#define I2C_READ2                     2242
#define SSP2STAT_R_NOT_W              2243
#define R_nW2                         2244
#define SSP2STAT_READ_WRITE           2245
#define nWRITE2                       2246
#define R_W2                          2247
#define SSP2STAT_R_nW                 2248
#define SSP2STAT_NOT_WRITE            2249
#define SSP2STAT_S                    2250
#define S2                            2251
#define START2                        2252
#define SSP2STAT_I2C_START            2253
#define I2C_START2                    2254
#define P2                            2255
#define SSP2STAT_I2C_STOP             2256
#define STOP2                         2257
#define SSP2STAT_P                    2258
#define I2C_STOP2                     2259
#define I2C_DAT2                      2260
#define DATA_ADDRESS2                 2261
#define SSP2STAT_D_NOT_A              2262
#define SSP2STAT_I2C_DAT              2263
#define D_A2                          2264
#define SSP2STAT_NOT_ADDRESS          2265
#define SSP2STAT_D_nA                 2266
#define SSP2STAT_DATA_ADDRESS         2267
#define SSP2STAT_nADDRESS             2268
#define nA2                           2269
#define DA2                           2270
#define nADDRESS2                     2271
#define SSP2STAT_nA                   2272
#define SSP2STAT_D_A                  2273
#define D_nA2                         2274
#define SSP2STAT_CKE                  2275
#define CKE2                          2276
#define SSP2STAT_SMP                  2277
#define SMP2                          2278
#define PSTR3CON                      2279
#define PSTR3CON_STRA                 2280
#define STRA3                         2281
#define STRB3                         2282
#define PSTR3CON_STRB                 2283
#define PSTR3CON_STRC                 2284
#define STRC3                         2285
#define STRD3                         2286
#define PSTR3CON_STRD                 2287
#define STRSYNC3                      2288
#define PSTR3CON_STRSYNC              2289
#define PSTR3CON_CMPL0                2290
#define CMPL03                        2291
#define PSTR3CON_CMPL                 2292
#define CMPL13                        2293
#define PSTR3CON_CMPL1                2294
#define PSTR2CON                      2295
#define PSTR2CON_STRA                 2296
#define P2DC02                        2297
#define STRA2                         2298
#define P2DC0CON                      2299
#define STRB2                         2300
#define P2DC12                        2301
#define PSTR2CON_STRB                 2302
#define P2DC1CON                      2303
#define STRC2                         2304
#define PSTR2CON_STRC                 2305
#define P2DC22                        2306
#define P2DC2CON                      2307
#define P2DC32                        2308
#define STRD2                         2309
#define PSTR2CON_STRD                 2310
#define P2DC3CON                      2311
#define P2DC4CON                      2312
#define STRSYNC2                      2313
#define PSTR2CON_STRSYNC              2314
#define P2DC42                        2315
#define P2DC6CON                      2316
#define PSTR2CON_CMPL                 2317
#define CMPL02                        2318
#define P2DC62                        2319
#define PSTR2CON_CMPL0                2320
#define CMPL12                        2321
#define PSTR2CON_CMPL1                2322
#define TXREG2                        2323
#define RCREG2                        2324
#define SPBRG2                        2325
#define SPBRG2_BRG0                   2326
#define SPBRG2_BRG1                   2327
#define SPBRG2_BRG2                   2328
#define SPBRG2_BRG3                   2329
#define SPBRG2_BRG4                   2330
#define SPBRG2_BRG5                   2331
#define SPBRG2_BRG6                   2332
#define SPBRG2_BRG7                   2333
#define SPBRGH2                       2334
#define SPBRGH2_BRG8                  2335
#define SPBRGH2_BRG9                  2336
#define SPBRGH2_BRG10                 2337
#define SPBRGH2_BRG11                 2338
#define SPBRGH2_BRG12                 2339
#define SPBRGH2_BRG13                 2340
#define SPBRGH2_BRG14                 2341
#define SPBRGH2_BRG15                 2342
#define DSGPR3                        2343
#define DSGPR2                        2344
#define DSGPR1                        2345
#define DSGPR0                        2346
#define DSWAKEH                       2347
#define DSINT0                        2348
#define DSWAKEL                       2349
#define DSPOR                         2350
#define DSICD                         2351
#define DSMCLR                        2352
#define DSRTC                         2353
#define DSWDT                         2354
#define DSULP                         2355
#define DSWAKEL_BOR                   2356
#define DSFLT                         2357
#define DSCONH                        2358
#define RTCWDIS                       2359
#define DSEN                          2360
#define DSCONL                        2361
#define RELEASE                       2362
#define DSBOR                         2363
#define ULPWDIS                       2364
#define TXREG3                        2365
#define RCREG3                        2366
#define SPBRG3                        2367
#define SPBRG3_BRG0                   2368
#define SPBRG3_BRG1                   2369
#define SPBRG3_BRG2                   2370
#define SPBRG3_BRG3                   2371
#define SPBRG3_BRG4                   2372
#define SPBRG3_BRG5                   2373
#define SPBRG3_BRG6                   2374
#define SPBRG3_BRG7                   2375
#define SPBRGH3                       2376
#define SPBRGH3_BRG8                  2377
#define SPBRGH3_BRG9                  2378
#define SPBRGH3_BRG10                 2379
#define SPBRGH3_BRG11                 2380
#define SPBRGH3_BRG12                 2381
#define SPBRGH3_BRG13                 2382
#define SPBRGH3_BRG14                 2383
#define SPBRGH3_BRG15                 2384
#define BAUDCON3                      2385
#define BAUDCON3_ABDEN                2386
#define BAUDCON3_WUE                  2387
#define BAUDCON3_IREN                 2388
#define BAUDCON3_BRG16                2389
#define BAUDCON3_TXCKP                2390
#define BAUDCON3_RXDTP                2391
#define BAUDCON3_RCIDL                2392
#define BAUDCON3_ABDOVF               2393
#define TXSTA3                        2394
#define TXSTA3_TX9D                   2395
#define TXSTA3_TRMT                   2396
#define TXSTA3_BRGH                   2397
#define TXSTA3_SENDB                  2398
#define TXSTA3_SYNC                   2399
#define TXSTA3_TXEN                   2400
#define TXSTA3_TX9                    2401
#define TXSTA3_CSRC                   2402
#define RCSTA3                        2403
#define RCSTA3_RX9D                   2404
#define RCSTA3_OERR                   2405
#define RCSTA3_FERR                   2406
#define RCSTA3_ADDEN                  2407
#define RCSTA3_CREN                   2408
#define RCSTA3_SREN                   2409
#define RCSTA3_RX9                    2410
#define RCSTA3_SPEN                   2411
#define SPBRGH1_BRG8                  2412
#define SPBRGH1                       2413
#define SPBRGH1_BRG9                  2414
#define SPBRGH1_BRG10                 2415
#define SPBRGH1_BRG11                 2416
#define SPBRGH1_BRG12                 2417
#define SPBRGH1_BRG13                 2418
#define SPBRGH1_BRG14                 2419
#define SPBRGH1_BRG15                 2420
#define BAUDCON2                      2421
#define ABDEN2                        2422
#define BAUDCON2_ABDEN                2423
#define WUE2                          2424
#define BAUDCON2_WUE                  2425
#define BAUDCON2_IREN                 2426
#define BRG162                        2427
#define BAUDCON2_BRG16                2428
#define SCKP2                         2429
#define TXCKP2                        2430
#define BAUDCON2_TXCKP                2431
#define DTRXP2                        2432
#define RXDTP2                        2433
#define BAUDCON2_RXDTP                2434
#define RCMT2                         2435
#define RCIDL2                        2436
#define BAUDCON2_RCIDL                2437
#define BAUDCON2_ABDOVF               2438
#define ABDOVF2                       2439
#define TXSTA2                        2440
#define TXSTA2_TX9D                   2441
#define TXD82                         2442
#define TXSTA2_TRMT                   2443
#define TXSTA2_BRGH                   2444
#define TXSTA2_SENDB                  2445
#define TXSTA2_SYNC                   2446
#define TXSTA2_TXEN                   2447
#define TX8_92                        2448
#define TXSTA2_TX9                    2449
#define TXSTA2_CSRC                   2450
#define RCSTA2                        2451
#define RCD82                         2452
#define RCSTA2_RX9D                   2453
#define RCSTA2_OERR                   2454
#define RCSTA2_FERR                   2455
#define RCSTA2_ADDEN                  2456
#define RCSTA2_CREN                   2457
#define RCSTA2_SREN                   2458
#define RC92                          2459
#define RC8_92                        2460
#define RCSTA2_RX9                    2461
#define RCSTA2_SPEN                   2462
#define CCPTMRS2                      2463
#define C8TSEL0                       2464
#define C8TSEL                        2465
#define C8TSEL1                       2466
#define C9TSEL                        2467
#define C9TSEL0                       2468
#define C10TSEL0                      2469
#define C10TSEL                       2470
#define CCPTMRS1                      2471
#define C4TSEL                        2472
#define C4TSEL0                       2473
#define C4TSEL1                       2474
#define C5TSEL                        2475
#define C5TSEL0                       2476
#define C6TSEL0                       2477
#define C6TSEL                        2478
#define C7TSEL                        2479
#define C7TSEL0                       2480
#define C7TSEL1                       2481
#define CCPTMRS0                      2482
#define C1TSEL0                       2483
#define C1TSEL                        2484
#define C1TSEL1                       2485
#define C1TSEL2                       2486
#define C2TSEL0                       2487
#define C2TSEL                        2488
#define C2TSEL1                       2489
#define C2TSEL2                       2490
#define C3TSEL0                       2491
#define C3TSEL                        2492
#define C3TSEL1                       2493
#define CM3CON                        2494
#define CM3CON_CCH                    2495
#define CCH03                         2496
#define CM3CON_CCH0                   2497
#define CCH13                         2498
#define CM3CON_CCH1                   2499
#define CM3CON_CREF                   2500
#define CREF3                         2501
#define CM3CON_EVPOL                  2502
#define EVPOL03                       2503
#define CM3CON_EVPOL0                 2504
#define CM3CON_EVPOL1                 2505
#define EVPOL13                       2506
#define CM3CON_CPOL                   2507
#define CPOL3                         2508
#define COE3                          2509
#define CM3CON_COE                    2510
#define CM3CON_CON                    2511
#define CON3                          2512
#define CM2CON                        2513
#define CM2CON_CCH                    2514
#define CM2CON_CCH0                   2515
#define CCH02                         2516
#define CCH12                         2517
#define CM2CON_CCH1                   2518
#define CM2CON_CREF                   2519
#define CREF2                         2520
#define CM2CON_EVPOL                  2521
#define EVPOL02                       2522
#define CM2CON_EVPOL0                 2523
#define EVPOL12                       2524
#define CM2CON_EVPOL1                 2525
#define CM2CON_CPOL                   2526
#define CPOL2                         2527
#define CM2CON_COE                    2528
#define COE2                          2529
#define CM2CON_CON                    2530
#define CON2                          2531
#define SSP2CON3                      2532
#define SSP2CON3_DHEN                 2533
#define SSP2CON3_AHEN                 2534
#define SSP2CON3_SBCDE                2535
#define SSP2CON3_SDAHT                2536
#define SSP2CON3_BOEN                 2537
#define SSP2CON3_SCIE                 2538
#define SSP2CON3_PCIE                 2539
#define SSP2CON3_ACKTIM               2540
#define T8CON                         2541
#define T8CKPS0                       2542
#define T8CKPS                        2543
#define T8CKPS1                       2544
#define TMR8ON                        2545
#define T8OUTPS                       2546
#define T8OUTPS0                      2547
#define T8OUTPS1                      2548
#define T8OUTPS2                      2549
#define T8OUTPS3                      2550
#define PR8                           2551
#define TMR8                          2552
#define T6CON                         2553
#define T6CKPS0                       2554
#define T6CKPS                        2555
#define T6CKPS1                       2556
#define TMR6ON                        2557
#define T6OUTPS0                      2558
#define T6OUTPS                       2559
#define T6OUTPS1                      2560
#define T6OUTPS2                      2561
#define T6OUTPS3                      2562
#define PR6                           2563
#define TMR6                          2564
#define CCP10CON                      2565
#define CCP10M                        2566
#define CCP10M0                       2567
#define CCP10M1                       2568
#define CCP10M2                       2569
#define CCP10M3                       2570
#define CCP10Y                        2571
#define DC10B0                        2572
#define DC10B                         2573
#define CCP10X                        2574
#define DC10B1                        2575
#define CCPR10L                       2576
#define CCPR10H                       2577
#define CCP9CON                       2578
#define CCP9M0                        2579
#define CCP9M                         2580
#define CCP9M1                        2581
#define CCP9M2                        2582
#define CCP9M3                        2583
#define CCP9Y                         2584
#define DC9B0                         2585
#define DC9B                          2586
#define CCP9X                         2587
#define DC9B1                         2588
#define CCPR9L                        2589
#define CCPR9H                        2590
#define CCP8CON                       2591
#define CCP8M0                        2592
#define CCP8M                         2593
#define CCP8M1                        2594
#define CCP8M2                        2595
#define CCP8M3                        2596
#define DC8B0                         2597
#define CCP8Y                         2598
#define DC8B                          2599
#define DC8B1                         2600
#define CCP8X                         2601
#define CCPR8L                        2602
#define CCPR8H                        2603
#define CCP3CON                       2604
#define CCP3M                         2605
#define CCP3M0                        2606
#define CCP3M1                        2607
#define CCP3M2                        2608
#define CCP3M3                        2609
#define CCP3Y                         2610
#define DC3B                          2611
#define DC3B0                         2612
#define DC3B1                         2613
#define CCP3X                         2614
#define P3M                           2615
#define P3M0                          2616
#define P3M1                          2617
#define CCPR3L                        2618
#define CCPR3H                        2619
#define ECCP3DEL                      2620
#define P3DC                          2621
#define P3DC0                         2622
#define P3DC1                         2623
#define P3DC2                         2624
#define P3DC3                         2625
#define P3DC4                         2626
#define P3DC5                         2627
#define P3DC6                         2628
#define P3RSEN                        2629
#define PSS3BD0                       2630
#define PSS3BD                        2631
#define PSS3BD1                       2632
#define PSS3AC0                       2633
#define PSS3AC                        2634
#define PSS3AC1                       2635
#define ECCP3AS                       2636
#define ECCP3AS0                      2637
#define ECCP3AS1                      2638
#define ECCP3AS2                      2639
#define ECCP3ASE                      2640
#define CCP2CON                       2641
#define CCP2M                         2642
#define CCP2M0                        2643
#define CCP2M1                        2644
#define CCP2M2                        2645
#define CCP2M3                        2646
#define DC2B                          2647
#define DC2B0                         2648
#define CCP2Y                         2649
#define DC2B1                         2650
#define CCP2X                         2651
#define P2M                           2652
#define P2M0                          2653
#define P2M1                          2654
#define CCPR2L                        2655
#define CCPR2H                        2656
#define ECCP2DEL                      2657
#define P2DC                          2658
#define P2DC0                         2659
#define P2DC1                         2660
#define P2DC2                         2661
#define P2DC3                         2662
#define P2DC4                         2663
#define P2DC5                         2664
#define P2DC6                         2665
#define P2RSEN                        2666
#define PSS2BD                        2667
#define PSS2BD0                       2668
#define PSS2BD1                       2669
#define PSS2AC0                       2670
#define PSS2AC                        2671
#define PSS2AC1                       2672
#define ECCP2AS0                      2673
#define ECCP2AS                       2674
#define ECCP2AS1                      2675
#define ECCP2AS2                      2676
#define ECCP2ASE                      2677
#define CM1CON                        2678
#define CM1CON_CCH                    2679
#define C1CH0                         2680
#define CM1CON_CCH0                   2681
#define CCH01                         2682
#define CCH11                         2683
#define C1CH1                         2684
#define CM1CON_CCH1                   2685
#define CM1CON_CREF                   2686
#define CREF1                         2687
#define EVPOL01                       2688
#define CM1CON_EVPOL0                 2689
#define CM1CON_EVPOL                  2690
#define CM1CON_EVPOL1                 2691
#define EVPOL11                       2692
#define CM1CON_CPOL                   2693
#define CPOL1                         2694
#define CM1CON_COE                    2695
#define COE1                          2696
#define CM1CON_CON                    2697
#define CON1                          2698
#define PADCFG1                       2699
#define RLPU                          2700
#define PMPTTL                        2701
#define RKPU                          2702
#define PADCFG1_RJPU                  2703
#define RHPU                          2704
#define RGPU                          2705
#define RFPU                          2706
#define REPU                          2707
#define RDPU                          2708
#define IOCN                          2709
#define IOCN0                         2710
#define IOCN1                         2711
#define IOCN2                         2712
#define IOCN3                         2713
#define IOCN4                         2714
#define IOCN5                         2715
#define IOCN6                         2716
#define IOCN7                         2717
#define IOCP                          2718
#define IOCP0                         2719
#define IOCP1                         2720
#define IOCP2                         2721
#define IOCP3                         2722
#define IOCP4                         2723
#define IOCP5                         2724
#define IOCP6                         2725
#define IOCP7                         2726
#define RTCCON2                       2727
#define RTCSECSEL                     2728
#define RTCSECSEL0                    2729
#define RTCSECSEL1                    2730
#define RTCCLKSEL0                    2731
#define RTCCLKSEL                     2732
#define RTCCLKSEL1                    2733
#define PWCSPRE                       2734
#define PWCCPRE                       2735
#define PWCPOL                        2736
#define PWCEN                         2737
#define ALRMVALL                      2738
#define ALRMVALH                      2739
#define ALRMRPT                       2740
#define ARPT0                         2741
#define ARPT                          2742
#define ARPT1                         2743
#define ARPT2                         2744
#define ARPT3                         2745
#define ARPT4                         2746
#define ARPT5                         2747
#define ARPT6                         2748
#define ARPT7                         2749
#define ALRMCFG                       2750
#define ALRMPTR                       2751
#define ALRMPTR0                      2752
#define ALRMPTR1                      2753
#define AMASK0                        2754
#define AMASK                         2755
#define AMASK1                        2756
#define AMASK2                        2757
#define AMASK3                        2758
#define CHIME                         2759
#define ALRMEN                        2760
#define RTCVALL                       2761
#define WAITE0                        2762
#define RTCVALH                       2763
#define WAITE1                        2764
