tiborsimon/embedded-tdd-headers/pic/pic18/pic18f67j94_tdd.h
#define WAITM0                        2765
#define WAITM1                        2766
#define WAITM2                        2767
#define WAITM3                        2768
#define WAITB0                        2769
#define WAITB1                        2770
#define RTCCAL                        2771
#define CAL0                          2772
#define CAL                           2773
#define CAL1                          2774
#define CAL2                          2775
#define CAL3                          2776
#define CAL4                          2777
#define CAL5                          2778
#define CAL6                          2779
#define CAL7                          2780
#define RTCCON1                       2781
#define RTCPTR0                       2782
#define RTCPTR                        2783
#define RTCPTR1                       2784
#define RTCOE                         2785
#define HALFSEC                       2786
#define RTCSYNC                       2787
#define RTCWREN                       2788
#define RTCEN                         2789
#define DMACON1                       2790
#define DMAEN                         2791
#define DLYINTEN                      2792
#define DUPLEX                        2793
#define DUPLEX0                       2794
#define DUPLEX1                       2795
#define RXINC                         2796
#define TXINC                         2797
#define SSCON                         2798
#define SSCON0                        2799
#define SSCON1                        2800
#define PIE6                          2801
#define CMP1IE                        2802
#define CMP2IE                        2803
#define CMP3IE                        2804
#define TX3IE                         2805
#define RC3IE                         2806
#define TX4IE                         2807
#define RC4IE                         2808
#define WPUB                          2809
#define WPUB0                         2810
#define WPUB1                         2811
#define WPUB2                         2812
#define WPUB3                         2813
#define WPUB4                         2814
#define WPUB5                         2815
#define WPUB6                         2816
#define WPUB7                         2817
#define ACTCON                        2818
#define ACTORSPOL                     2819
#define ACTORS                        2820
#define ACTLOCKPOL                    2821
#define ACTLOCK                       2822
#define ACTSRC                        2823
#define ACTSIDL                       2824
#define ACTEN                         2825
#define OSCCON4                       2826
#define PLLEN                         2827
#define CPDIV0                        2828
#define CPDIV                         2829
#define CPDIV1                        2830
#define OSCCON3                       2831
#define IRCF                          2832
#define IRCF0                         2833
#define IRCF1                         2834
#define IRCF2                         2835
#define OSCCON2                       2836
#define SOSCGO                        2837
#define POSCEN                        2838
#define CF                            2839
#define LOCK                          2840
#define IOLOCK                        2841
#define CLKLOCK                       2842
#define BAUDCON1                      2843
#define BAUDCON1_ABDEN                2844
#define ABDEN1                        2845
#define BAUDCON1_WUE                  2846
#define WUE1                          2847
#define BAUDCON1_IREN                 2848
#define BRG161                        2849
#define BAUDCON1_BRG16                2850
#define CKTXP                         2851
#define BAUDCON1_TXCKP                2852
#define SCKP1                         2853
#define TXCKP1                        2854
#define SCKP                          2855
#define DTRXP1                        2856
#define RXDTP1                        2857
#define DTRXP                         2858
#define RXCKP                         2859
#define BAUDCON1_RXDTP                2860
#define RCMT1                         2861
#define RCIDL1                        2862
#define BAUDCON1_RCIDL                2863
#define RCMT                          2864
#define ABDOVF1                       2865
#define BAUDCON1_ABDOVF               2866
#define SSP1MSK                       2867
#define SSP1MSK_MSK0                  2868
#define SSP1MSK_SSPMSK                2869
#define SSP1MSK_MSK1                  2870
#define SSP1MSK_MSK2                  2871
#define SSP1MSK_MSK3                  2872
#define SSP1MSK_MSK4                  2873
#define SSP1MSK_MSK5                  2874
#define SSP1MSK_MSK6                  2875
#define SSP1MSK_MSK7                  2876
#define SSP1CON3                      2877
#define SSP1CON3_DHEN                 2878
#define SSP1CON3_AHEN                 2879
#define SSP1CON3_SBCDE                2880
#define SSP1CON3_SDAHT                2881
#define SSP1CON3_BOEN                 2882
#define SSP1CON3_SCIE                 2883
#define SSP1CON3_PCIE                 2884
#define SSP1CON3_ACKTIM               2885
#define TXBUF0                        2886
#define TXBUF                         2887
#define TXBUF1                        2888
#define TXBUF2                        2889
#define TXBUF3                        2890
#define TXBUF4                        2891
#define TXBUF5                        2892
#define TXBUF6                        2893
#define TXBUF7                        2894
#define DMABCH                        2895
#define BC8                           2896
#define DMACNTHB                      2897
#define BC9                           2898
#define DMABCL                        2899
#define DMACNTLB                      2900
#define BC0                           2901
#define BC1                           2902
#define BC2                           2903
#define BC3                           2904
#define BC4                           2905
#define BC5                           2906
#define BC6                           2907
#define BC7                           2908
#define RXADDRH                       2909
#define RXADDR8                       2910
#define DMARCVPTRHB                   2911
#define RXADDR9                       2912
#define RXADDR10                      2913
#define RXADDR11                      2914
#define RXADDRL                       2915
#define DMARCVPTRLB                   2916
#define RXADDR0                       2917
#define RXADDR1                       2918
#define RXADDR2                       2919
#define RXADDR3                       2920
#define RXADDR4                       2921
#define RXADDR5                       2922
#define RXADDR6                       2923
#define RXADDR7                       2924
#define TXADDRH                       2925
#define TXADDR8                       2926
#define DMATXPTRHB                    2927
#define TXADDR9                       2928
#define TXADDR10                      2929
#define TXADDR11                      2930
#define TXADDRL                       2931
#define DMATXPTRLB                    2932
#define TXADDR0                       2933
#define TXADDR1                       2934
#define TXADDR2                       2935
#define TXADDR3                       2936
#define TXADDR4                       2937
#define TXADDR5                       2938
#define TXADDR6                       2939
#define TXADDR7                       2940
#define PORTVP                        2941
#define RVP0                          2942
#define RVP1                          2943
#define RVP2                          2944
#define RVP3                          2945
#define RVP4                          2946
#define RVP5                          2947
#define RVP6                          2948
#define RVP7                          2949
#define LATVP                         2950
#define LATVP0                        2951
#define LATVP1                        2952
#define LATVP2                        2953
#define LATVP3                        2954
#define LATVP4                        2955
#define LATVP5                        2956
#define LATVP6                        2957
#define LATVP7                        2958
#define TRISVP                        2959
#define TRISVP0                       2960
#define TRISVP1                       2961
#define TRISVP2                       2962
#define TRISVP3                       2963
#define TRISVP4                       2964
#define TRISVP5                       2965
#define TRISVP6                       2966
#define TRISVP7                       2967
#define UADDR                         2968
#define ADDR                          2969
#define ADDR0                         2970
#define ADDR1                         2971
#define ADDR2                         2972
#define ADDR3                         2973
#define ADDR4                         2974
#define ADDR5                         2975
#define ADDR6                         2976
#define UCON                          2977
#define SUSPND                        2978
#define RESUME                        2979
#define USBEN                         2980
#define PKTDIS                        2981
#define SE0                           2982
#define PPBRST                        2983
#define USTAT                         2984
#define PPBI                          2985
#define DIR                           2986
#define ENDP                          2987
#define ENDP0                         2988
#define ENDP1                         2989
#define ENDP2                         2990
#define ENDP3                         2991
#define UEIR                          2992
#define PIDEF                         2993
#define CRC5EF                        2994
#define CRC16EF                       2995
#define DFN8EF                        2996
#define BTOEF                         2997
#define BTSEF                         2998
#define UIR                           2999
#define URSTIF                        3000
#define UERRIF                        3001
#define ACTVIF                        3002
#define TRNIF                         3003
#define IDLEIF                        3004
#define STALLIF                       3005
#define SOFIF                         3006
#define UFRMH                         3007
#define FRM8                          3008
#define UFRMH_FRM                     3009
#define FRM9                          3010
#define FRM10                         3011
#define UFRML                         3012
#define FRML                          3013
#define FRM0                          3014
#define UFRML_FRM                     3015
#define FRM1                          3016
#define FRM2                          3017
#define FRM3                          3018
#define FRM4                          3019
#define FRM5                          3020
#define FRM6                          3021
#define FRM7                          3022
#define RCON4                         3023
#define PMSLP                         3024
#define DPSLP                         3025
#define SRETEN                        3026
#define RCON3                         3027
#define VBAT                          3028
#define VBPOR                         3029
#define VDDPOR                        3030
#define VDDBOR                        3031
#define STKERR                        3032
#define RCON2                         3033
#define SWDTEN                        3034
#define EXTR                          3035
#define EECON2                        3036
#define EECON1                        3037
#define WR                            3038
#define WREN                          3039
#define WRERR                         3040
#define FREE                          3041
#define WWPROG                        3042
#define PORTA                         3043
#define ULPWUIN                       3044
#define RA0                           3045
#define RA1                           3046
#define RA2                           3047
#define RA3                           3048
#define RA4                           3049
#define LVDIN                         3050
#define RA5                           3051
#define RA6                           3052
#define PORTA_RJPU                    3053
#define RA7                           3054
#define PORTB                         3055
#define RB0                           3056
#define RB1                           3057
#define RB2                           3058
#define CCP2_PA2                      3059
#define RB3                           3060
#define RB4                           3061
#define RB5                           3062
#define RB6                           3063
#define RB7                           3064
#define PORTC                         3065
#define RC0                           3066
#define PA2                           3067
#define RC1                           3068
#define CCP2                          3069
#define PA1                           3070
#define RC2                           3071
#define RC3                           3072
#define RC4                           3073
#define RC5                           3074
#define RC6                           3075
#define RC7                           3076
#define PORTD                         3077
#define RD0                           3078
#define RD1                           3079
#define RD2                           3080
#define RD3                           3081
#define RD4                           3082
#define RD5                           3083
#define RD6                           3084
#define RD7                           3085
#define SS2                           3086
#define PORTE                         3087
#define PD2                           3088
#define RDE                           3089
#define RE0                           3090
#define WRE                           3091
#define RE1                           3092
#define PC2                           3093
#define PORTE_CS                      3094
#define CCP10                         3095
#define PB2                           3096
#define RE2                           3097
#define CCP9E                         3098
#define RE3                           3099
#define PC3E                          3100
#define PB3E                          3101
#define RE4                           3102
#define CCP8E                         3103
#define CCP7E                         3104
#define RE5                           3105
#define PC1E                          3106
#define CCP6E                         3107
#define RE6                           3108
#define PB1E                          3109
#define CCP2E                         3110
#define PA2E                          3111
#define RE7                           3112
#define PORTF                         3113
#define RF2                           3114
#define C1OUTF                        3115
#define RF3                           3116
#define RF4                           3117
#define RF5                           3118
#define RF6                           3119
#define RF7                           3120
#define PORTG                         3121
#define RG0                           3122
#define RG1                           3123
#define C3OUTG                        3124
#define RG2                           3125
#define RG3                           3126
#define RG4                           3127
#define LATA                          3128
#define LATA0                         3129
#define LA0                           3130
#define LATA1                         3131
#define LA1                           3132
#define LATA2                         3133
#define LA2                           3134
#define LATA3                         3135
#define LA3                           3136
#define LATA4                         3137
#define LA4                           3138
#define LATA5                         3139
#define LA5                           3140
#define LATA6                         3141
#define LA6                           3142
#define LATA7                         3143
#define LA7                           3144
#define LATB                          3145
#define LB0                           3146
#define LATB0                         3147
#define LB1                           3148
#define LATB1                         3149
#define LB2                           3150
#define LATB2                         3151
#define LB3                           3152
#define LATB3                         3153
#define LB4                           3154
#define LATB4                         3155
#define LB5                           3156
#define LATB5                         3157
#define LB6                           3158
#define LATB6                         3159
#define LB7                           3160
#define LATB7                         3161
#define LATC                          3162
#define LATC0                         3163
#define LC0                           3164
#define LATC1                         3165
#define LC1                           3166
#define LATC2                         3167
#define LC2                           3168
#define LATC3                         3169
#define LC3                           3170
#define LATC4                         3171
#define LC4                           3172
#define LATC5                         3173
#define LC5                           3174
#define LATC6                         3175
#define LC6                           3176
#define LATC7                         3177
#define LC7                           3178
#define LATD                          3179
#define LATD0                         3180
#define LD0                           3181
#define LATD1                         3182
#define LD1                           3183
#define LATD2                         3184
#define LD2                           3185
#define LATD3                         3186
#define LD3                           3187
#define LATD4                         3188
#define LD4                           3189
#define LATD5                         3190
#define LD5                           3191
#define LATD6                         3192
#define LD6                           3193
#define LATD7                         3194
#define LD7                           3195
#define LATE                          3196
#define LATE0                         3197
#define LE0                           3198
#define LATE1                         3199
#define LE1                           3200
#define LATE2                         3201
#define LE2                           3202
#define LATE3                         3203
#define LE3                           3204
#define LATE4                         3205
#define LE4                           3206
#define LATE5                         3207
#define LE5                           3208
#define LATE6                         3209
#define LE6                           3210
#define LATE7                         3211
#define LE7                           3212
#define LATF                          3213
#define LF2                           3214
#define LATF2                         3215
#define LF3                           3216
#define LATF3                         3217
#define LF4                           3218
#define LATF4                         3219
#define LF5                           3220
#define LATF5                         3221
#define LF6                           3222
#define LATF6                         3223
#define LF7                           3224
#define LATF7                         3225
#define LATG                          3226
#define LATG0                         3227
#define LG0                           3228
#define LATG1                         3229
#define LG1                           3230
#define LATG2                         3231
#define LG2                           3232
#define LATG3                         3233
#define LG3                           3234
#define LATG4                         3235
#define LG4                           3236
#define TRISA                         3237
#define TRISA0                        3238
#define TRISA1                        3239
#define TRISA2                        3240
#define TRISA3                        3241
#define TRISA4                        3242
#define TRISA5                        3243
#define TRISA6                        3244
#define TRISA7                        3245
#define TRISB                         3246
#define TRISB0                        3247
#define TRISB1                        3248
#define TRISB2                        3249
#define TRISB3                        3250
#define TRISB4                        3251
#define TRISB5                        3252
#define TRISB6                        3253
#define TRISB7                        3254
#define TRISC                         3255
#define TRISC0                        3256
#define TRISC1                        3257
#define TRISC2                        3258
#define TRISC3                        3259
#define TRISC4                        3260
#define TRISC5                        3261
#define TRISC6                        3262
#define TRISC7                        3263
#define TRISD                         3264
#define TRISD0                        3265
#define TRISD1                        3266
#define TRISD2                        3267
#define TRISD3                        3268
#define TRISD4                        3269
#define TRISD5                        3270
#define TRISD6                        3271
#define TRISD7                        3272
#define TRISE                         3273
#define TRISE0                        3274
#define TRISE1                        3275
#define TRISE2                        3276
#define TRISE3                        3277
#define TRISE4                        3278
#define TRISE5                        3279
#define TRISE6                        3280
#define TRISE7                        3281
#define TRISF                         3282
#define TRISF2                        3283
#define TRISF3                        3284
#define TRISF4                        3285
#define TRISF5                        3286
#define TRISF6                        3287
#define TRISF7                        3288
#define TRISG                         3289
#define TRISG0                        3290
#define TRISG1                        3291
#define TRISG2                        3292
#define TRISG3                        3293
#define TRISG4                        3294
#define OSCTUNE                       3295
#define TUN0                          3296
#define TUN                           3297
#define TUN1                          3298
#define TUN2                          3299
#define TUN3                          3300
#define TUN4                          3301
#define TUN5                          3302
#define PSTR1CON                      3303
#define PSTR1CON_STRA                 3304
#define PSTR1CON_STRB                 3305
#define PSTR1CON_STRC                 3306
#define PSTR1CON_STRD                 3307
#define PSTR1CON_STRSYNC              3308
#define PSTR1CON_CMPL0                3309
#define PSTR1CON_CMPL                 3310
#define PSTR1CON_CMPL1                3311
#define PIE1                          3312
#define TMR1IE                        3313
#define TMR2IE                        3314
#define TMR1GIE                       3315
#define SSP1IE                        3316
#define TXIE                          3317
#define TX1IE                         3318
#define RC1IE                         3319
#define ADIE                          3320
#define PSPIE                         3321
#define PIR1                          3322
