tiborsimon/embedded-tdd-headers/pic/pic18/pic18f67j94_tdd.h
#define TMR1IF                        3323
#define TMR2IF                        3324
#define TMR1GIF                       3325
#define SSP1IF                        3326
#define TXIF                          3327
#define TX1IF                         3328
#define RC1IF                         3329
#define ADIF                          3330
#define PSPIF                         3331
#define IPR1                          3332
#define TMR1IP                        3333
#define TMR2IP                        3334
#define TMR1GIP                       3335
#define SSP1IP                        3336
#define TX1IP                         3337
#define RC1IP                         3338
#define ADIP                          3339
#define PSPIP                         3340
#define PIE2                          3341
#define TMR3GIE                       3342
#define TMR3IE                        3343
#define HLVDIE                        3344
#define BCL1IE                        3345
#define USBIE                         3346
#define BCL2IE                        3347
#define SSP2IE                        3348
#define CMIE                          3349
#define OSCFIE                        3350
#define PIR2                          3351
#define TMR3GIF                       3352
#define TMR3IF                        3353
#define HLVDIF                        3354
#define LVDIF                         3355
#define BCL1IF                        3356
#define USBIF                         3357
#define BCL2IF                        3358
#define CMIF                          3359
#define SSP2IF                        3360
#define OSCFIF                        3361
#define IPR2                          3362
#define TMR3GIP                       3363
#define TMR3IP                        3364
#define HLVDIP                        3365
#define BCL1IP                        3366
#define USBIP                         3367
#define BCL2IP                        3368
#define CMIP                          3369
#define SSP2IP                        3370
#define OSCFIP                        3371
#define PIE3                          3372
#define RXB0IE                        3373
#define RTCCIE                        3374
#define RXBNIE                        3375
#define CCP1IE                        3376
#define RXB1IE                        3377
#define CCP2IE                        3378
#define TXB0IE                        3379
#define CTMUIE                        3380
#define TXB1IE                        3381
#define TXBNIE                        3382
#define TXB2IE                        3383
#define TX2IE                         3384
#define RC2IE                         3385
#define LCDIE                         3386
#define TMR5GIE                       3387
#define PIR3                          3388
#define RTCCIF                        3389
#define RXBNIF                        3390
#define CCP1IF                        3391
#define CCP2IF                        3392
#define CTMUIF                        3393
#define TXBNIF                        3394
#define TX2IF                         3395
#define RC2IF                         3396
#define LCDIF                         3397
#define TMR5GIF                       3398
#define IPR3                          3399
#define RTCCIP                        3400
#define CCP1IP                        3401
#define RXBNIP                        3402
#define CCP2IP                        3403
#define CTMUIP                        3404
#define TX2IP                         3405
#define TXBNIP                        3406
#define RC2IP                         3407
#define LCDIP                         3408
#define TMR5GIP                       3409
#define PIR6                          3410
#define CMP1IF                        3411
#define CMP2IF                        3412
#define CMP3IF                        3413
#define TX3IF                         3414
#define RC3IF                         3415
#define TX4IF                         3416
#define RC4IF                         3417
#define PSPCON                        3418
#define PSPMODE                       3419
#define IBOV                          3420
#define OBF                           3421
#define IBF                           3422
#define HLVDCON                       3423
#define HLVDL                         3424
#define HLVDL0                        3425
#define HLVDL1                        3426
#define HLVDL2                        3427
#define HLVDL3                        3428
#define HLVDEN                        3429
#define IRVST                         3430
#define BGVST                         3431
#define VDIRMAG                       3432
#define IPR6                          3433
#define CMP1IP                        3434
#define CMP2IP                        3435
#define CMP3IP                        3436
#define TX3IP                         3437
#define RC3IP                         3438
#define TX4IP                         3439
#define RC4IP                         3440
#define T1GCON                        3441
#define T1GSS0                        3442
#define T1GSS                         3443
#define T1GSS1                        3444
#define T1GVAL                        3445
#define T1GGO_nT1DONE                 3446
#define nT1DONE                       3447
#define T1GGO_NOT_T1DONE              3448
#define NOT_T1DONE                    3449
#define T1GGO                         3450
#define T1GSPM                        3451
#define T1GTM                         3452
#define T1GPOL                        3453
#define TMR1GE                        3454
#define RCSTA1                        3455
#define RCD8                          3456
#define RCSTA1_RX9D                   3457
#define RCSTA1_OERR                   3458
#define RCSTA1_FERR                   3459
#define RCSTA1_ADDEN                  3460
#define ADEN                          3461
#define RCSTA1_CREN                   3462
#define RCSTA1_SREN                   3463
#define SRENA                         3464
#define RC8_9                         3465
#define RC9                           3466
#define RCSTA1_RX9                    3467
#define RCSTA1_SPEN                   3468
#define TXSTA1                        3469
#define TX9D1                         3470
#define TXSTA1_TX9D                   3471
#define TXD8                          3472
#define TRMT1                         3473
#define TXSTA1_TRMT                   3474
#define BRGH1                         3475
#define TXSTA1_BRGH                   3476
#define TXSTA1_SENDB                  3477
#define SENDB1                        3478
#define TXSTA1_SYNC                   3479
#define SYNC1                         3480
#define TXEN1                         3481
#define TXSTA1_TXEN                   3482
#define TX91                          3483
#define TX8_9                         3484
#define TXSTA1_TX9                    3485
#define TXSTA1_CSRC                   3486
#define CSRC1                         3487
#define TXREG1                        3488
#define RCREG1                        3489
#define SPBRG1_BRG0                   3490
#define SPBRG1                        3491
#define SPBRG1_BRG1                   3492
#define SPBRG1_BRG2                   3493
#define SPBRG1_BRG3                   3494
#define SPBRG1_BRG4                   3495
#define SPBRG1_BRG5                   3496
#define SPBRG1_BRG6                   3497
#define SPBRG1_BRG7                   3498
#define T3GCON                        3499
#define T3GSS0                        3500
#define T3GSS                         3501
#define T3GSS1                        3502
#define T3GVAL                        3503
#define T3GGO                         3504
#define NOT_T3DONE                    3505
#define nT3DONE                       3506
#define T3GGO_nT3DONE                 3507
#define T3GGO_NOT_T3DONE              3508
#define T3GSPM                        3509
#define T3GTM                         3510
#define T3GPOL                        3511
#define TMR3GE                        3512
#define T3CON                         3513
#define TMR3ON                        3514
#define T3CON_RD16                    3515
#define nT3SYNC                       3516
#define NOT_T3SYNC                    3517
#define SOSCEN3                       3518
#define T3CON_SOSCEN                  3519
#define T3CKPS0                       3520
#define T3CON_TCKPS                   3521
#define T3CKPS1                       3522
#define TMR3CS0                       3523
#define TMR3CS                        3524
#define TMR3CS1                       3525
#define T3RD16                        3526
#define RD163                         3527
#define TMR3L                         3528
#define TMR3H                         3529
#define PIE4                          3530
#define ECCP3IE                       3531
#define CCP4IE                        3532
#define CCP5IE                        3533
#define CCP6IE                        3534
#define CCP7IE                        3535
#define CCP8IE                        3536
#define CCP9IE                        3537
#define CCP10IE                       3538
#define PIR4                          3539
#define ECCP3IF                       3540
#define CCP4IF                        3541
#define CCP5IF                        3542
#define CCP6IF                        3543
#define CCP7IF                        3544
#define CCP8IF                        3545
#define CCP9IF                        3546
#define CCP10IF                       3547
#define IPR4                          3548
#define ECCP3IP                       3549
#define CCIP3IP                       3550
#define CCP4IP                        3551
#define CCP5IP                        3552
#define CCP6IP                        3553
#define CCP7IP                        3554
#define CCP8IP                        3555
#define CCP9IP                        3556
#define CCP10IP                       3557
#define PIE5                          3558
#define TMR4IE                        3559
#define TMR5IE                        3560
#define TMR6IE                        3561
#define TMR8IE                        3562
#define ACTLOCKIE                     3563
#define ACTORSIE                      3564
#define PIR5                          3565
#define TMR4IF                        3566
#define TMR5IF                        3567
#define TMR6IF                        3568
#define TMR8IF                        3569
#define ACTLOCKIF                     3570
#define ACTORSIF                      3571
#define CCP1CON                       3572
#define CCP1M0                        3573
#define CCP1M                         3574
#define CCP1M1                        3575
#define CCP1M2                        3576
#define CCP1M3                        3577
#define CCP1Y                         3578
#define DC1B                          3579
#define DC1B0                         3580
#define CCP1X                         3581
#define DC1B1                         3582
#define P1M                           3583
#define P1M0                          3584
#define P1M1                          3585
#define CCPR1L                        3586
#define CCPR1H                        3587
#define ECCP1DEL                      3588
#define P1DC                          3589
#define P1DC0                         3590
#define P1DC1                         3591
#define P1DC2                         3592
#define P1DC3                         3593
#define P1DC4                         3594
#define P1DC5                         3595
#define P1DC6                         3596
#define P1RSEN                        3597
#define PSS1BD0                       3598
#define PSS1BD                        3599
#define PSS1BD1                       3600
#define PSS1AC                        3601
#define PSS1AC0                       3602
#define PSS1AC1                       3603
#define ECCP1AS                       3604
#define ECCP1AS0                      3605
#define ECCP1AS1                      3606
#define ECCP1AS2                      3607
#define ECCP1ASE                      3608
#define CVRCONL                       3609
#define CVRNSS                        3610
#define CVRPSS0                       3611
#define CVRPSS                        3612
#define CVRPSS1                       3613
#define CVROE                         3614
#define CVREN                         3615
#define CVRCONH                       3616
#define CVR                           3617
#define CVR0                          3618
#define CVR1                          3619
#define CVR2                          3620
#define CVR3                          3621
#define CVR4                          3622
#define ADCON1L                       3623
#define DONE                          3624
#define SAMP                          3625
#define ASAM                          3626
#define SSRC0                         3627
#define SSRC                          3628
#define SSRC1                         3629
#define SSRC2                         3630
#define SSRC3                         3631
#define ADCON1H                       3632
#define FORM0                         3633
#define FORM                          3634
#define FORM1                         3635
#define MODE12                        3636
#define ADON                          3637
#define ADCBUF0L                      3638
#define ADCBUF0H                      3639
#define CMSTAT                        3640
#define C1OUT                         3641
#define C2OUT                         3642
#define C3OUT                         3643
#define SSP1CON2                      3644
#define SEN1                          3645
#define SSP1CON2_SEN                  3646
#define ADMSK11                       3647
#define SSP1CON2_RSEN                 3648
#define RSEN1                         3649
#define SSP1CON2_ADMSK1               3650
#define SSP1CON2_ADMSK                3651
#define SSP1CON2_PEN                  3652
#define ADMSK21                       3653
#define PEN1                          3654
#define SSP1CON2_ADMSK2               3655
#define ADMSK31                       3656
#define RCEN1                         3657
#define SSP1CON2_RCEN                 3658
#define SSP1CON2_ADMSK3               3659
#define SSP1CON2_ACKEN                3660
#define ACKEN1                        3661
#define ADMSK41                       3662
#define SSP1CON2_ADMSK4               3663
#define ACKDT1                        3664
#define ADMSK51                       3665
#define SSP1CON2_ACKDT                3666
#define SSP1CON2_ADMSK5               3667
#define SSP1CON2_ACKSTAT              3668
#define ACKSTAT1                      3669
#define GCEN1                         3670
#define SSP1CON2_GCEN                 3671
#define SSP1CON1                      3672
#define SSP1CON1_SSPM0                3673
#define SSPM01                        3674
#define SSP1CON1_SSPM                 3675
#define SSP1CON1_SSPM1                3676
#define SSPM11                        3677
#define SSP1CON1_SSPM2                3678
#define SSPM21                        3679
#define SSPM31                        3680
#define SSP1CON1_SSPM3                3681
#define SSP1CON1_CKP                  3682
#define CKP1                          3683
#define SSPEN1                        3684
#define SSP1CON1_SSPEN                3685
#define SSPOV1                        3686
#define SSP1CON1_SSPOV                3687
#define WCOL1                         3688
#define SSP1CON1_WCOL                 3689
#define SSP1STAT                      3690
#define BF1                           3691
#define SSP1STAT_BF                   3692
#define UA1                           3693
#define SSP1STAT_UA                   3694
#define SSP1STAT_R_NOT_W              3695
#define RW1                           3696
#define SSP1STAT_nW                   3697
#define RW                            3698
#define SSP1STAT_READ_WRITE           3699
#define SSP1STAT_nWRITE               3700
#define SSP1STAT_I2C_READ             3701
#define SSP1STAT_R_W                  3702
#define R                             3703
#define SSP1STAT_NOT_WRITE            3704
#define SSP1STAT_R_nW                 3705
#define SSP1STAT_S                    3706
#define START                         3707
#define START1                        3708
#define SSP1STAT_I2C_START            3709
#define STOP                          3710
#define SSP1STAT_P                    3711
#define STOP1                         3712
#define SSP1STAT_I2C_STOP             3713
#define SSP1STAT_D_NOT_A              3714
#define SSP1STAT_D_A                  3715
#define SSP1STAT_D_nA                 3716
#define SSP1STAT_NOT_ADDRESS          3717
#define SSP1STAT_DATA_ADDRESS         3718
#define SSP1STAT_nA                   3719
#define D                             3720
#define DA1                           3721
#define DA                            3722
#define SSP1STAT_nADDRESS             3723
#define SSP1STAT_I2C_DAT              3724
#define SSP1STAT_CKE                  3725
#define CKE1                          3726
#define SSP1STAT_SMP                  3727
#define SMP1                          3728
#define SSP1ADD                       3729
#define SSP1ADD_SSPADD                3730
#define SSP1ADD_MSK0                  3731
#define MSK01                         3732
#define SSP1ADD_MSK1                  3733
#define MSK11                         3734
#define SSP1ADD_MSK2                  3735
#define MSK21                         3736
#define MSK31                         3737
#define SSP1ADD_MSK3                  3738
#define SSP1ADD_MSK4                  3739
#define MSK41                         3740
#define SSP1ADD_MSK5                  3741
#define MSK51                         3742
#define MSK61                         3743
#define SSP1ADD_MSK6                  3744
#define SSP1ADD_MSK7                  3745
#define MSK71                         3746
#define SSP1BUF                       3747
#define SSP1BUF_SSPBUF                3748
#define T2CON                         3749
#define T2CKPS0                       3750
#define T2CKPS                        3751
#define T2CKPS1                       3752
#define TMR2ON                        3753
#define T2OUTPS0                      3754
#define T2OUTPS                       3755
#define T2OUTPS1                      3756
#define T2OUTPS2                      3757
#define T2OUTPS3                      3758
#define PR2_WM0                       3759
#define PR2                           3760
#define PR2_WM1                       3761
#define WAIT0                         3762
#define WAIT1                         3763
#define EBDIS                         3764
#define TMR2                          3765
#define T1CON                         3766
#define TMR1ON                        3767
#define T1CON_RD16                    3768
#define NOT_T1SYNC                    3769
#define nT1SYNC                       3770
#define T1CON_SOSCEN                  3771
#define T1OSCEN                       3772
#define T1CKPS0                       3773
#define T1CON_TCKPS                   3774
#define T1CKPS1                       3775
#define TMR1CS0                       3776
#define TMR1CS                        3777
#define T1RD16                        3778
#define TMR1CS1                       3779
#define TMR1L                         3780
#define TMR1H                         3781
#define RCON                          3782
#define RCON_BOR                      3783
#define NOT_BOR                       3784
#define nBOR                          3785
#define POR                           3786
#define nPOR                          3787
#define NOT_POR                       3788
#define PD                            3789
#define nPD                           3790
#define NOT_PD                        3791
#define nTO                           3792
#define TO                            3793
#define NOT_TO                        3794
#define nRI                           3795
#define NOT_RI                        3796
#define RI                            3797
#define NOT_CM                        3798
#define RCON_CM                       3799
#define nCM                           3800
#define IPEN                          3801
#define IOCF                          3802
#define IOCF0                         3803
#define IOCF1                         3804
#define IOCF2                         3805
#define IOCF3                         3806
#define IOCF4                         3807
#define IOCF5                         3808
#define IOCF6                         3809
#define IOCF7                         3810
#define IPR5                          3811
#define CCH05                         3812
#define TMR4IP                        3813
#define CCH15                         3814
#define TMR5IP                        3815
#define TMR6IP                        3816
#define EVPOL15                       3817
#define TMR8IP                        3818
#define ACTLOCKIP                     3819
#define ACTORSIP                      3820
#define OSCCON                        3821
#define NOSC0                         3822
#define NOSC                          3823
#define SCS                           3824
#define NOSC1                         3825
#define NOSC2                         3826
#define COSC                          3827
#define COSC0                         3828
#define COSC1                         3829
#define COSC2                         3830
#define IDLEN                         3831
#define T0CON                         3832
#define T0PS                          3833
#define T0PS0                         3834
#define T0PS1                         3835
#define T0PS2                         3836
#define PSA                           3837
#define T0CS                          3838
#define T0CS0                         3839
#define T0CS1                         3840
#define T08BIT                        3841
#define TMR0ON                        3842
#define TMR0L                         3843
#define TMR0H                         3844
#define STATUS                        3845
#define C                             3846
#define CARRY                         3847
#define DC                            3848
#define ZERO                          3849
#define Z                             3850
#define OV                            3851
#define OVERFLOW                      3852
#define N                             3853
#define NEGATIVE                      3854
#define FSR2L                         3855
#define PLUSW2                        3856
#define PREINC2                       3857
#define POSTDEC2                      3858
#define POSTINC2                      3859
#define INDF2                         3860
#define FSR1L                         3861
#define PLUSW1                        3862
#define PREINC1                       3863
#define POSTDEC1                      3864
#define POSTINC1                      3865
#define INDF1                         3866
#define WREG                          3867
#define FSR0L                         3868
#define PLUSW0                        3869
#define PREINC0                       3870
#define POSTDEC0                      3871
#define POSTINC0                      3872
#define INDF0                         3873
#define INTCON3                       3874
#define INT1IF                        3875
#define INT1F                         3876
#define INT2IF                        3877
#define INT2F                         3878
#define INT3F                         3879
#define INT3IF                        3880
