tiborsimon/embedded-tdd-headers/pic/pic18/pic18f67j94_tdd.h
#define INT1E                         3881
#define INT1IE                        3882
#define INT2IE                        3883
#define INT2E                         3884
#define INT3E                         3885
#define INT3IE                        3886
#define INT1P                         3887
#define INT1IP                        3888
#define INT2IP                        3889
#define INT2P                         3890
#define INTCON2                       3891
#define IOCIP                         3892
#define INT3IP                        3893
#define INT3P                         3894
#define TMR0IP                        3895
#define T0IP                          3896
#define INTEDG3                       3897
#define INTEDG2                       3898
#define INTEDG1                       3899
#define INTEDG0                       3900
#define NOT_RBPU                      3901
#define RBPU                          3902
#define nRBPU                         3903
#define INTCON                        3904
#define IOCIF                         3905
#define INT0F                         3906
#define INT0IF                        3907
#define T0IF                          3908
#define TMR0IF                        3909
#define IOCIE                         3910
#define INT0E                         3911
#define INT0IE                        3912
#define T0IE                          3913
#define TMR0IE                        3914
#define PEIE                          3915
#define PEIE_GIEL                     3916
#define GIEL                          3917
#define GIEH                          3918
#define GIE_GIEH                      3919
#define GIE                           3920
#define PRODL                         3921
#define PRODH                         3922
#define TABLAT                        3923
#define TBLPTRL                       3924
#define TBLPTRH                       3925
#define PCL                           3926
#define PCLATH                        3927
#define PCH                           3928
#define SP0                           3929
#define STKPTR                        3930
#define SP1                           3931
#define SP2                           3932
#define SP3                           3933
#define SP4                           3934
#define STKUNF                        3935
#define STKOVF                        3936
#define STKFUL                        3937
#define TOSL                          3938
#define TOSH                          3939

#endif // _PIC18F67J94_H_
